# SlopedInnerEdge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlabShapeFailures..::..SlopedInnerEdge Property
BuiltInFailures..::..SlabShapeFailures Class See Also
---
Inner loops of a footprint sketch may not have slope-defining lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlopedInnerEdge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlopedInnerEdge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlopedInnerEdge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlabShapeFailures Class
Autodesk.Revit.DB Namespace